Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkAttributes.TagsAttributes Property
 The tags A1-A5 in the section mark attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkTagsAttributes TagsAttributes { get; set; }
Public Property TagsAttributes As SectionMarkBase.SectionMarkTagsAttributes
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkTagsAttributes
See Also
Reference
SectionMarkBase.SectionMarkAttributes Class
Tekla.Structures.Drawing Namespace